{"pageProps":{"post":{"title":"How to stand out as a software engineer or developer on LinkedIn","description":"In this article, I explain to you what I have been doing to my LinkedIn profile to get contacted by 3-5 recruiters every single day!","slug":"how-to-stand-out-as-a-software-engineer-or-developer-on-linkedin","tags":["career","linkedin","jobsearch"],"date":"2020-07-28","content":"\nMost of us developers like to hang out on Github, Twitter and Medium. LinkedIn becomes an afterthought that most of us don't really pay attention to. However, it is where recruiters are, so having a profile that stands out of the crowd is especially important.\n\nIn this article, I explain to you what I have been doing to my LinkedIn profile to get contacted by 3-5 recruiters every single day!\n\n## About section\n\nHave an exciting and engaging paragraph or two explaining what your passion is, and which technologies you have experience with. Here is mine:\n\n> I am a passionate Software Engineer, specialised in front-end development using React and TypeScript. As an advocate for web performance and accessibility and an evangelist for the Jamstack, I create amazing web applications to make the internet a better place.\n\nThis is short and sweet; it tells recruiters precisely what I do and how the team they are hiring for could benefit from me.\n\n## Experience section\n\nList all your relevant experience and provide short bullet points with the work you were doing and mention the technologies you worked with. Some great points might be:\n\n- Led a team of 5 front-end engineers\n- Developed web applications using TypeScript, React, GraphQL and Sass\n- Increased site traffic by 40%\n- Improved Jest test coverage by 20%\n\n## Education and Licenses & Certificates\n\nI personally never went to university. Straight out of college I founded my own agency, and I was my own boss for the first seven years of my career, and yet, I have been hired as a senior software engineer and have been contacted by recruiters from Facebook and Google. This proves that education is not everything. It does, however, help if you have some certificates that you can list on your LinkedIn profile. The one that I found sparked most interest for me is the [CS50 certificate from Harvard University](https://cs50.harvard.edu/x/2020/). It is a free computer science course you can take online in about 8-12 weeks that teaches many fundamentals that are great for engineers of all levels.\n\nOther certificates you can list are those you get from sites like Pluralsight, Udemy or LinkedIn Learning.\n\n## Volunteer Experience\n\nI have been a mentor on [Coding Coach](https://codingcoach.io/) for a while, where I help more junior developers achieve their goals. While this is a relatively small amount of effort, it lead to many questions during interviews I have had and showed the interviewer my interpersonal skills.\n\nOther volunteering experience you can add here is Open Source experience, for example, if you regularly contribute to a specific project on Github, add it to your LinkedIn profile as volunteer experience.\n\n## Skills\n\nWhile most recruiters say they do not look at the skills and endorsements part on a LinkedIn profile, I found that a lot of endorsements spark interest as well. I have my top skills all at 99+ endorsements. I would also recommend taking the skill quizzes you can take on LinkedIn for free - they are great to show that you actually possess those skills and don't just put them there as fancy buzz words.\n\nHow to get 99+ endorsements? Ask people you worked with, even if you did not work with them directly. I asked a lot of my former colleagues, clients and friends to endorse me on LinkedIn in return for endorsements on their skills.\n\n## Recommendation\n\nRecommendations are generally harder to get than endorsements because your (former) co-workers have to actually spend some time writing a couple of paragraphs about you. In my opinion, it is worth convincing co-workers to write recommendations for you, as those genuinely give a more in-depth insight into you as a co-worker. I would try to get to around ten recommendations to stand out of the crowd.\n\n---\n\nIf you follow all the above, you are on the right track to becoming a LinkedIn all-star!\n"},"mdxSource":{"compiledSource":"var c=Object.defineProperty,d=Object.defineProperties;var u=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var l=(e,t,o)=>t in e?c(e,t,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[t]=o,a=(e,t)=>{for(var o in t||(t={}))i.call(t,o)&&l(e,o,t[o]);if(r)for(var o of r(t))s.call(t,o)&&l(e,o,t[o]);return e},h=(e,t)=>d(e,u(t));var p=(e,t)=>{var o={};for(var n in e)i.call(e,n)&&t.indexOf(n)<0&&(o[n]=e[n]);if(e!=null&&r)for(var n of r(e))t.indexOf(n)<0&&s.call(e,n)&&(o[n]=e[n]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var n=o,{components:e}=n,t=p(n,[\"components\"]);return mdx(MDXLayout,h(a(a({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Most of us developers like to hang out on Github, Twitter and Medium. LinkedIn becomes an afterthought that most of us don't really pay attention to. However, it is where recruiters are, so having a profile that stands out of the crowd is especially important.\"),mdx(\"p\",null,\"In this article, I explain to you what I have been doing to my LinkedIn profile to get contacted by 3-5 recruiters every single day!\"),mdx(\"h2\",null,\"About section\"),mdx(\"p\",null,\"Have an exciting and engaging paragraph or two explaining what your passion is, and which technologies you have experience with. Here is mine:\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"I am a passionate Software Engineer, specialised in front-end development using React and TypeScript. As an advocate for web performance and accessibility and an evangelist for the Jamstack, I create amazing web applications to make the internet a better place.\")),mdx(\"p\",null,\"This is short and sweet; it tells recruiters precisely what I do and how the team they are hiring for could benefit from me.\"),mdx(\"h2\",null,\"Experience section\"),mdx(\"p\",null,\"List all your relevant experience and provide short bullet points with the work you were doing and mention the technologies you worked with. Some great points might be:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Led a team of 5 front-end engineers\"),mdx(\"li\",{parentName:\"ul\"},\"Developed web applications using TypeScript, React, GraphQL and Sass\"),mdx(\"li\",{parentName:\"ul\"},\"Increased site traffic by 40%\"),mdx(\"li\",{parentName:\"ul\"},\"Improved Jest test coverage by 20%\")),mdx(\"h2\",null,\"Education and Licenses & Certificates\"),mdx(\"p\",null,\"I personally never went to university. Straight out of college I founded my own agency, and I was my own boss for the first seven years of my career, and yet, I have been hired as a senior software engineer and have been contacted by recruiters from Facebook and Google. This proves that education is not everything. It does, however, help if you have some certificates that you can list on your LinkedIn profile. The one that I found sparked most interest for me is the \",mdx(\"a\",a({parentName:\"p\"},{href:\"https://cs50.harvard.edu/x/2020/\"}),\"CS50 certificate from Harvard University\"),\". It is a free computer science course you can take online in about 8-12 weeks that teaches many fundamentals that are great for engineers of all levels.\"),mdx(\"p\",null,\"Other certificates you can list are those you get from sites like Pluralsight, Udemy or LinkedIn Learning.\"),mdx(\"h2\",null,\"Volunteer Experience\"),mdx(\"p\",null,\"I have been a mentor on \",mdx(\"a\",a({parentName:\"p\"},{href:\"https://codingcoach.io/\"}),\"Coding Coach\"),\" for a while, where I help more junior developers achieve their goals. While this is a relatively small amount of effort, it lead to many questions during interviews I have had and showed the interviewer my interpersonal skills.\"),mdx(\"p\",null,\"Other volunteering experience you can add here is Open Source experience, for example, if you regularly contribute to a specific project on Github, add it to your LinkedIn profile as volunteer experience.\"),mdx(\"h2\",null,\"Skills\"),mdx(\"p\",null,\"While most recruiters say they do not look at the skills and endorsements part on a LinkedIn profile, I found that a lot of endorsements spark interest as well. I have my top skills all at 99+ endorsements. I would also recommend taking the skill quizzes you can take on LinkedIn for free - they are great to show that you actually possess those skills and don't just put them there as fancy buzz words.\"),mdx(\"p\",null,\"How to get 99+ endorsements? Ask people you worked with, even if you did not work with them directly. I asked a lot of my former colleagues, clients and friends to endorse me on LinkedIn in return for endorsements on their skills.\"),mdx(\"h2\",null,\"Recommendation\"),mdx(\"p\",null,\"Recommendations are generally harder to get than endorsements because your (former) co-workers have to actually spend some time writing a couple of paragraphs about you. In my opinion, it is worth convincing co-workers to write recommendations for you, as those genuinely give a more in-depth insight into you as a co-worker. I would try to get to around ten recommendations to stand out of the crowd.\"),mdx(\"hr\",null),mdx(\"p\",null,\"If you follow all the above, you are on the right track to becoming a LinkedIn all-star!\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}},"__N_SSG":true}